use labor_sql;



-- 1. БД «Комп. фірма». Знайти виробників ПК. Вивести: maker, type.
-- Вихідні дані впорядкувати за спаданням за стовпцем maker.

SELECT distinct maker, type FROM product 
WHERE type = "PC" order by maker DESC;

-- 2. БД «Аеропорт». З таблиці Pass_in_trip вивести дати, коли були зай-
-- няті місця 'c' у будь-якому ряді.

SELECT date FROM pass_in_trip 
WHERE place like '%c';

-- 3. БД «Аеропорт». Для пасажирів таблиці Passenger вивести дати, коли 
--  вони користувалися послугами авіаліній.
-- SELECT pass_in_trip.date 
-- 4. БД «Кораблі». Вивести класи всіх кораблів України ('Ukraine'). Як-
-- що в БД немає класів кораблів України, тоді вивести класи для всіх
-- наявних у БД країн. Вивести: country, class.

SELECT country, class FROM CLASSES where country = 'Ukraine' or  EXISTS (SELECT country, class FROM CLASSES WHERE country != 'Ukraine');

-- 5. БД «Комп. фірма». Виведіть тих виробників ноутбуків, які не випускають принтери.

SELECT maker FROM product WHERE type != "Printer"; 

-- 6. БД «Комп. фірма». Для таблиці Printer вивести всю інформацію з
-- коментарями в кожній комірці, наприклад, 'модель: 1276', 'ціна: 400,00' і т.д.

select COLUMN_NAME AS label, 
from INFORMATION_SCHEMA.COLUMNS
where TABLE_NAME='printer' 

-- 7. БД «Кораблі». Для кожної країни визначити рік, у якому було спущено на воду 
-- максимальна кількість її кораблів. У випадку, якщо виявиться декілька таких років, 
-- тоді взяти мінімальний із них. Вивести:country, кількість кораблів, рік.

-- 8. БД «Комп. фірма». Для таблиці Product отримати підсумковий набір
-- у вигляді таблиці зі стовпцями maker, pc, laptop та printer, у якій для
-- кожного виробника необхідно вказати кількість продукції, що ним ви-
-- пускається, тобто наявну загальну кількість продукції в таблицях, від-
-- повідно, PC, Laptop та Printer. (Підказка: використовувати підзапити в
-- якості обчислювальних стовпців)


-- 9. БД «Комп. фірма». Для таблиці Product отримати підсумковий набір

-- у вигляді таблиці зі стовпцями maker, laptop, у якій для кожного ви-
-- робника необхідно вказати, чи виробляє він ('yes'), чи ні ('no') відповідний тип продукції. 
-- У першому випадку ('yes') додатково вказати поруч у круглих дужках загальну кількість наявної 
-- (тобто, що знаходиться в таблиці Laptop) продукції, наприклад, 'yes(2)'. (Підказка:
-- використовувати підзапити в якості обчислювальних стовпців та
-- оператор CASE)

-- 10. БД «Кораблі». Знайдіть класи, до яких входить лише один корабель з усієї 
-- БД (врахувати також кораблі в таблиці Outcomes, яких немає в таблиці Ships). 
-- Вивести: class. (Підказка: використовувати оператор UNION та операцію EXISTS)